In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_csv("income.csv", names=["name", "monthly_income"], skiprows =[0])
df

        name  monthly_income
0        Rob            5000
1      Rafiq            6000
2       Nina            4000
3      Sofia            7500
4      Mohan            8000
5        Tao            7000
6  Elon Musk        10000000

In [3]:
df.monthly_income.describe()

count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07
Name: monthly_income, dtype: float64

In [4]:
df.monthly_income.quantile(0)

4000.0

In [6]:
df.monthly_income.quantile(0.25, interpolation = "higher" )

6000

In [7]:
df.monthly_income.quantile(0.5, interpolation = "higher")

7000

In [8]:
df.monthly_income.quantile(0.75)

7750.0

In [9]:
df.monthly_income.quantile(1)

10000000.0

In [12]:
percentile_99 =df.monthly_income.quantile(0.999)
percentile_99

9940048.000000007

In [13]:
df[df.monthly_income>percentile_99]

        name  monthly_income
6  Elon Musk        10000000

In [14]:
df["monthly_income"][4] = np.NaN
df

C:\Users\mothe\AppData\Local\Temp\ipykernel_25416\1557387366.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["monthly_income"][4] = np.NaN

        name  monthly_income
0        Rob          5000.0
1      Rafiq          6000.0
2       Nina          4000.0
3      Sofia          7500.0
4      Mohan             NaN
5        Tao          7000.0
6  Elon Musk      10000000.0

In [15]:
df.monthly_income.median()

6500.0

In [17]:
df.monthly_income.mean()

6

##  filling null values with the median is a good choice for a right-skewed dataset.

In [19]:
df_new = df.fillna(df.monthly_income.median())
df_new

        name  monthly_income
0        Rob          5000.0
1      Rafiq          6000.0
2       Nina          4000.0
3      Sofia          7500.0
4      Mohan          6500.0
5        Tao          7000.0
6  Elon Musk      10000000.0